{"type":"Page","label":"Main Page","description":"Main page","style":{"layout":"column","borderRadius":{},"borderStyleColorWidth":{},"borderStyle":{},"borderWidth":{},"borderColor":{"bottom":"none"},"flexDirection":"wb-flex-column","padding":{"left":"10px","right":"10px"},"margin":{},"alignItems":"wb-flex-align-items-stretch","justifyContent":"wb-flex-justify-content-start"},"contents":[{"text":"<h2>Designing a default page as 'page not found!'</h2>\n<p style=\"text-align: justify;\">Sometimes we see on some sites that the requested page doesn't exist. It may happen that the site owner removed&nbsp;a page from the site and forgot to remove related links that point to the page. Also, other reasons may lead&nbsp;to this problem.</p>\n<p style=\"text-align: justify;\">In this case, the users will see an empty page or encounter with an error like 'page not found.' The design of the application can be in some way that automatically redirects the users to the main page (or every desired page) of application or site. This option requires to be done by the developer team. Instead of this option,&nbsp;This page will allow you to design your favorite page.</p>\n<p style=\"text-align: justify;\">Here, You may want to design a special page to display when this error occurs. For example, you may want to put some links in the page to refer to the different part of your site and put into the page some texts, images and other things.</p>\n<p style=\"text-align: justify;\">&nbsp;</p>\n<h3>How could you design the page?</h3>\n<p style=\"text-align: justify;\">Similar to designing other pages, here you can design the page&nbsp;as you wish. Drag and drop the widgets you want and design your desired page. As soon as you design this page,&nbsp;From now on you and your site users will see the page when the requested page doesn't exist.</p>\n<p>&nbsp;</p>\n<h3>How to save the designed page?</h3>\n<p>The designed page will be saved automatically without doing additional work.</p>\n<p>&nbsp;</p>\n<h3>How could you see the result (designed page)?</h3>\n<p style=\"text-align: justify;\">After&nbsp;designing, if you want to see the result you can enter a wrong address at the end of the existing address in the address bar and see your designed page.</p>","type":"HtmlText","name":"Widget","style":{"borderColor":{"bottom":"none"},"margin":{},"borderRadius":{},"borderStyleColorWidth":{},"borderStyle":{},"borderWidth":{},"flexAlignItem":"wb-flex-item-auto"}}]}