{"type":"Page","label":"Main Page","description":"Main page","style":{"layout":"column","borderRadius":{},"borderStyleColorWidth":{},"borderStyle":{},"borderWidth":{},"borderColor":{"bottom":"none"},"flexDirection":"wb-flex-column","padding":{"left":"10px","right":"10px"},"margin":{},"alignItems":"wb-flex-align-items-stretch","justifyContent":"wb-flex-justify-content-start"},"contents":[{"text":"<h2 dir=\"rtl\">طراحی صفحه پیش فرض به عنوان \"صفحه مورد نظر یافت نشد\"</h2>\n<p dir=\"rtl\" style=\"text-align: justify;\">گاهی اوقات در برخی سایت ها وقتی بر روی لینکی کلیک می کنیم صفحه ی مورد نظر وجود ندارد و خطایی با عنوان \"صفحه مورد نظر یافت نشد\" بر روی صفحه نمایان می شود. از دلایل بروز این خطا به عنوان مثال ممکن است این باشد که مدیر سایت صفحه ای را پاک کرده باشد اما&nbsp; فراموش کرده باشد که لینک هایی را که به این صفحه اشاره دارند حذف کرده باشد. هر چند دلایل دیگری نیز می تواند منجر به بروز این خطا شود.</p>\n<p dir=\"rtl\" style=\"text-align: justify;\">در این حالت، کاربر با کلیک بر لینک مذکور، صفحه ای را درخواست کرده که وجود ندارد و خطای \"صفحه مورد نظر یافت نشد\" یا یک صفحه ی خالی را دریافت خواهد کرد.</p>\n<p dir=\"rtl\" style=\"text-align: justify;\">یکی از گزینه های ممکن برای رویارویی با این مسئله این است که از تیم توسه دهنده بخواهیم اپلیکیشن یا همان سایت را به گونه ای طراحی کند که هرگاه صفحه ای درخواست شد که وجود ندارد کاربر به صورت اتوماتیک به صفحه ی اول سایت یا همان \"خانه\" ارجاع داده شود.</p>\n<p dir=\"rtl\" style=\"text-align: justify;\">به جای گزینه ی فوق، ما در این صفحه این امکان را برای شما فراهم آورده ایم که صفحه ی دلخواهی را آنگونه که میل دارید بسازید تا - در مواقعی که خطای فوق به هر دلیل بروز می کند -&nbsp; به کاربر نشان داده شود. به عنوان مثال ممکن است بخواهید پیغام مناسبی را به کاربر نشان دهید، لینک هایی برای رفتن به صفحات مختلف در نظر بگیرید، عکس بگذارید و یا هر چیز دیگری...</p>\n<p dir=\"rtl\" style=\"text-align: justify;\">&nbsp;</p>\n<h3 dir=\"rtl\" style=\"text-align: justify;\">چگونه می توانید این صفحه را طراحی کنید؟</h3>\n<p dir=\"rtl\" style=\"text-align: justify;\">مشابه با طراحی دیگر صفحات، در اینجا نیز طراحی با استفاده از ویجت های مختلف قابل انجام است. ویجت های دلخواه خود را انتخاب کرده و طراحی مورد نظر خود را انجام دهید. به محض اینکه طراحی تمام شد از آن لحظه هرگاه صفحه ای درخواست شود که وجود ندارد این صفحه نمایان خواهد شد.</p>\n<h3 dir=\"rtl\" style=\"text-align: justify;\">&nbsp;</h3>\n<h3 dir=\"rtl\" style=\"text-align: justify;\">چگونه صفحه ی طراحی شده را ذخیره کنید؟</h3>\n<p dir=\"rtl\" style=\"text-align: justify;\">این صفحه به صورت اتوماتیک ذخیره می شود و نیازی به انجام کار خاصی نیست. وقتی طراحی تمام شد به هر صفحه ای که دوست دارید بروید. اگر در حین طراحی نیز به صفحه ی دیگری بروید صفحه برای شما ذخیره خواهد شد و هرگاه که دوباره به این قسمت از تنظیمات بازگشتید آن را مشاهده خواهید کرد.</p>\n<p dir=\"rtl\" style=\"text-align: justify;\">&nbsp;</p>\n<h3 dir=\"rtl\" style=\"text-align: justify;\">چگونه صفحه ی طراحی شده را آزمایش کنید؟</h3>\n<p dir=\"rtl\" style=\"text-align: justify;\">بعد از طراحی، چنانچه مایل هستید نتیجه ی کار خود را مورد آزمایش قرار دهید کافیست در نوار آدرس مرورگر به ادامه ی آدرسی که هم اکنون وجود دارد چند حرف یا کلمه ی تصادفی اضافه (یا کم) کنید و کلید enter را فشار دهید. همان صفحه ای که طراحی کردید برایتان نمایان خواهد شد.</p>","type":"HtmlText","name":"Widget","style":{"borderColor":{"bottom":"none"},"margin":{},"borderRadius":{},"borderStyleColorWidth":{},"borderStyle":{},"borderWidth":{},"flexAlignItem":"wb-flex-item-auto"}}]}